app/services/authorizer.rb

  def authorized_user
    @user ||= User.find_by_id(decoded_auth_token[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]