app/services/authorize_api_request.rb

  def authorized_user
    @user ||= User.find(decoded_auth_token[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]