app/services/authenticator.rb

  def user
    @user ||= User.find_by_email(email)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "1@qwe.sjda"], ["LIMIT", 1]]