app/services/authenticate_user.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "qwe@qwe.qwe"], ["LIMIT", 1]]
---
  def user
    @user ||= User.find_by_email(email)