app/services/users/creator.rb

    def create
      user.update_attributes(referrer: referrer) if referrer
---
UPDATE "users" SET "updated_at" = $1, "referrer_id" = $2 WHERE "users"."id" = $3  [["updated_at", "2021-02-07 15:12:52.174575"], ["referrer_id", 26], ["id", 27]]

    def referrer
      @referrer ||= User.find_by(referral_code: params[:referred_by])
---
SELECT  "users".* FROM "users" WHERE "users"."referral_code" = $1 LIMIT $2  [["referral_code", "gkgwaHrQrgPRRR7aHTvScstr"], ["LIMIT", 1]]

    def user
      @user ||= User.create!(
        email: params[:email],
        password: params[:password]
      )
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at", "referral_code") VALUES ($1, $2, $3, $4, $5) RETURNING "id"