app/services/users/creator.rb

    def referrer
      @referrer ||= User.find_by_id(params[:referrer_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]