app/controllers/registrations_controller.rb

  def user
    @user ||= User.create(sign_up_params)
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"