app/services/credits/processor.rb

    def process_new_user
      puts ' ' * 80
      puts "INIT CREDITS: #{new_user.credits}"
      puts ' ' * 80

      new_user.increment!(:credits, BONUS_CREDITS_AMOUNT) if referrer
---
UPDATE "users" SET "credits" = COALESCE("credits", 0) + 10 WHERE "users"."id" = $1  [["id", 35]]